# AllGridSegmentsRemoved Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..AllGridSegmentsRemoved Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Curtain grid lines must have at least one segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AllGridSegmentsRemoved { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllGridSegmentsRemoved As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AllGridSegmentsRemoved {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace